///泡泡排序法
///int a[10]={4,5,6, 1,2,3, 7,8,9, 0};///(1)陣列
///int a[10]={0, 3, 2, 1, 4, 5, 6, 7, 8, 9};///愾排好的
int a[10]={9, 8, 7, 6, 5, 4, 3, 2, 1, 0};///最差的情況
#include <stdio.h>
int main()
{
    for(int i=0; i<10; i++)printf("%d ", a[i]);
    printf("\n");///把現在的陣列列出來觀察

    for(int k=0;k<9;k++){
        for(int i=0;i<10-1;i++){///迴圈怎妹跑
            if( a[i] > a[i+1]){///(2)過來想,左大,右小,就交換
                int temp=a[i];///(3)交換
                a[i]=a[i+1];
                a[i+1]=temp;
            }
        }
        for(int i=0; i<10; i++)printf("%d ", a[i]);
        printf("\n");///把現在的陣列列出來觀察
    }
}
